#+STARTUP: content
#+STARTUP: fold
#+OPTIONS: toc:nil
#+OPTIONS: ^:nil
*** DONE (isucon serverが3台でない場合) workflow_dispatchのinputsが正しいか確認する
CLOSED: [2023-11-25 Sat 10:17]

#+begin_src shell :dir ~/.ghq/github.com/OL001-isucon/isucon12-final :results output
  grep -R "inputs:" .github
#+end_src

#+RESULTS:
: .github/workflows/run_bench.yml:    inputs:
: .github/workflows/before_bench_all.yml:    inputs:
: .github/workflows/sandbox_specific.yml:    inputs:
: .github/workflows/after_bench.yml:    inputs:
: .github/workflows/before_bench_specific.yml:    inputs:

*** DONE 動作しているプロセスを確認しておおよその構成を理解する
CLOSED: [2023-11-25 Sat 10:19]
Server:

#+begin_src bash
  sudo systemctl list-unit-files --type=service | grep -E "nginx|apache"
#+end_src

#+RESULTS:
: nginx.service                          enabled         enabled

DB:

#+begin_src bash
  sudo systemctl list-unit-files --type=service | grep -E "mysql|postgresql"
#+end_src

#+RESULTS:
: mysql.service                          enabled         enabled

Cache:

#+begin_src bash
  systemctl list-unit-files --type=service | grep -E "redis|memcached"
#+end_src
*** DONE emacsからDBに疏通確認する
CLOSED: [2023-11-25 Sat 12:04]
#+begin_src sql
  SELECT 1+1;
#+end_src

#+RESULTS:
| 1+1 |
|-----|
|   2 |

